/*
 *  면접
 *  ----
 *  함수 VS 메소드? => 한가지 기능을 수행하는 것으로 의미는 동일 
 *   |       |      but, 함수는 독립적으로 사용 메소드는 class 안에서만 사용(클래스 종속)
 *  ---    -----
 *   C      Java
 *  -------------------- 종료하는 시점 ==> return (생략 가능)
 *                                      컴파일러 통해 자동 추가됨 (return형 메소드가 있음:void..))
 *                                      모든 메소드는 무조건 하나의 return이 있음
 *  배열 / 메소드 => + => 클래스
 *                     -----
 *                         객체지향에 맞게 변경하는 방법 배운당
 *                                  |
 *                         데이터 보호 (캡슐화)
 *                         재사용 (상속,포함)
 *                               is-a, has-a
 *                         수정(modify), 추가(new) 
 *                                 ---  ---
 *                          ***오버라이딩 오버로딩
 *                            => 유지보수가 수월하도록 제작
 */
public class 제어문_반복제어문5 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
